system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(	
	(0 0 0)
    (1.5 0 0)
    (1.5 0.64 0)
    (0 0.64 0)
    (0 0 0.15)
    (1.5 0 0.15)
    (1.5 0.64 0.15)
    (0 0.64 0.15)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    slipwalls
    {
        type walls;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 3 2 1)			
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
	upperWall
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }

);

// ************************************************************************* //
